# http://www.stats.gov.cn/tjsj/zxfb/201807/t20180717_1610160.html

import pandas as pd

from cfg import data_root

'''
数据说明：

中国：
    gdp数据来自：http://www.stats.gov.cn/tjsj/zxfb/201807/t20180717_1610160.html；
    季度数据均可查；
    
美国：
    2014-2017年季度数据 = 年度数据/4
    2018年季度数据从网络新闻获取
    
俄罗斯：
    2014-2017年季度数据 = 年度数据/4
    2018年数据为0，未找到数据
    
巴西：
    2014-2017年季度数据 = 年度数据/4
    2018年季度数据从网络新闻获取
    
阿根廷：
    2014-2016年季度数据 = 年度数据/4
    2017-2018年季度数据从网络新闻获取
    


'''

gdp_growth_info = [["2014-第一季度", 0.017, 0.0064225, 0.0018475, 0.00127, 0.068275],
                   ["2014-第二季度", 0.018, 0.0064225, 0.0018475, 0.00127, 0.068275 ],
                   ["2014-第三季度", 0.018, 0.0064225, 0.0018475, 0.00127, 0.068275 ],
                   ["2014-第四季度", 0.017, 0.0064225, 0.0018475, 0.00127, 0.068275 ],

                   ["2015-第一季度", 0.017, 0.007155, -0.707, -0.008875, -0.0045575],
                   ["2015-第二季度", 0.018, 0.007155, -0.707, -0.008875, -0.0045575],
                   ["2015-第三季度", 0.017, 0.007155, -0.707, -0.008875, -0.0045575],
                   ["2015-第四季度", 0.015, 0.007155, -0.707, -0.008875, -0.0045575],

                   ["2016-第一季度", 0.014, 0.0037125,  0.05625, -0.00867, 0.00716],
                   ["2016-第二季度", 0.019, 0.0037125, 0.05625, -0.00867, 0.00716],
                   ["2016-第三季度", 0.017, 0.0037125, 0.05625, -0.00867, 0.00716],
                   ["2016-第四季度", 0.016, 0.0037125, 0.05625, -0.00867, 0.00716],

                   ["2017-第一季度", 0.015, 0.0056825, 0.003865, 0.00244, -0.021 ],
                   ["2017-第二季度", 0.019, 0.0056825, 0.003865, 0.00244, 0.003 ],
                   ["2017-第三季度", 0.018, 0.0056825, 0.003865, 0.00244, 0.027 ],
                   ["2017-第四季度", 0.016, 0.0056825, 0.003865, 0.00244, 0.045 ],

                   ["2018-第一季度", 0.014, 0.0023, '', 0.004, 0.039],
                   ["2018-第二季度", 0.018, 0.0041, '' ,0.0046, 0.036]]

gdp_growth_info_df = pd.DataFrame(gdp_growth_info, columns= ["季度", "中国-GDP增长速度", "美国-GDP增长速度", "俄罗斯-GDP增长速度", "巴西-GDP增长速度", "阿根廷-GDP增长速度"])

save_file = "gdp_growth_info.csv"
save_file_path = data_root + save_file
gdp_growth_info_df.to_csv(save_file_path, index=False)